In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    {
        'Name': [
            'Bob',
            'Tom',
            'Ken',
        ],
        'Age': [22,35,58],
        'Sex': ['male','male','female'],
    }
)

In [3]:
df

  Name  Age     Sex
0  Bob   22    male
1  Tom   35    male
2  Ken   58  female

In [4]:
df['Age']

0    22
1    35
2    58
Name: Age, dtype: int64

In [5]:
type(df['Age'])

pandas.core.series.Series

In [6]:
ages = pd.Series([22,35,58], name="Age")

In [7]:
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [8]:
df['Age'].max()

58

In [9]:
df['Age'].min()

22

In [10]:
ages.max()

58

In [12]:
# As methods are functions, do not forget to use parentheses ().
df['Age'].max

<bound method NDFrame._add_numeric_operations.<locals>.max of 0    22
1    35
2    58
Name: Age, dtype: int64>

In [14]:
# basic statistice(基本統計量)
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [15]:
df.describe(include='all')

       Name        Age   Sex
count     3   3.000000     3
unique    3        NaN     2
top     Bob        NaN  male
freq      1        NaN     2
mean    NaN  38.333333   NaN
std     NaN  18.230012   NaN
min     NaN  22.000000   NaN
25%     NaN  28.500000   NaN
50%     NaN  35.000000   NaN
75%     NaN  46.500000   NaN
max     NaN  58.000000   NaN

In [16]:
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [17]:
ages + ages

0     44
1     70
2    116
Name: Age, dtype: int64

In [18]:
ages * 2

0     44
1     70
2    116
Name: Age, dtype: int64